app/controllers/toys_controller.rb

  def update
    @toy = Toy.find(params[:id])
    if @toy.update(toy_params)
---
SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "toys" SET "pokemon_id" = $1, "updated_at" = $2 WHERE "toys"."id" = 3  [["pokemon_id", 2], ["updated_at", "2014-11-18 01:05:16.661756"]]